# IFCFileReadOptions Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCFileReadOptions Class
Members See Also
---
This class contains options to read an IFC file.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class IFCFileReadOptions : IDisposable
```

Visual Basic
---
```text
Public Class IFCFileReadOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class IFCFileReadOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.IFC..::..IFCFileReadOptions
# See Also
IFCFileReadOptions Members
Autodesk.Revit.DB.IFC Namespace